/*
ツつアツづ個姪「ツ妥ィツづ?づ債、ツヒツδ督トツづ?与ツつヲツづァツづェツづ?つ「ツづゥツ津環づィツ、ツ行ツ青板つェツ療アツ青板づ可氾、ツづ猟づ?氾アツ湘ュツづ可渉ュツづ按つ「ツづ?つキツ。
ツ行ツ青板づ個催?妥・ツつェ10ツづ?つ「ツつ、ツ点ツづ可陳債姪堋つオツづ慊つオツづ・ツつ、ツ。
ツ各ツ行ツづーツづ青づ?つュツづィツ陛板つキツつゥツづ青づ?つュツづィツ陛板つウツづ按つ「ツつゥツづ?つ「ツつ、ツ篠篠行ツづーツ、2^10ツづ個計ツ算ツ療環づ?偲?個サツづ?つォツづ慊つキツ。

ツつウツづ?、ツ各ツ行ツづーツづ青づ?つュツづィツ陛板つキツつゥツづ青づ?つュツづィツ陛板つウツづ按つ「ツつゥツつェツ個按づ慊づ?づ?つ「ツづゥツづ?可スツつェツつ、ツづェツつオツつ「ツづ?つオツづ・ツつ、ツつゥツ。
ツ各ツ療アツづーツ個ゥツつスツづ?つォツ、ツつサツづ個療アツづーツづ青づ?つュツづィツ陛板つキツつゥツづ青づ?つュツづィツ陛板つウツづ按つ「ツつゥツ、ツづ?づ?つソツつェツつ、ツづェツつオツつ「ツづ個つゥツづー
ツつキツつョツ仰?づ淞づゥツつアツづ?つェツづ?つォツづゥツづヲツつ、ツづ可づ按づィツづ慊つキツ。

ツ療。ツつヲツづ篠、ツ篠淞づ個づヲツつ、ツづ按つケツづアツづ猟つ「ツつェツ与ツつヲツづァツづェツつスツづ?つオツづ慊つキツ。

ツ?崢?慊?崢?慊??
ツ?慊?崢?崢?崢??

ツつアツづ個づ?つォツ、
ツ・1ツ行ツ姪堋づーツづ青づ?つュツづィツ陛板つキツつゥツづ青づ?つュツづィツ陛板つウツづ按つ「ツつゥツ、
ツ・2ツ行ツ姪堋づーツづ青づ?つュツづィツ陛板つキツつゥツづ青づ?つュツづィツ陛板つウツづ按つ「ツつゥツ、
ツづーツ催?帰ツづ可づヲツづィツ全ツ探ツ催オツつオツづ?個按津ィツつオツづ?づ「ツづィツづ慊つキツ。

ツつアツつアツづ?づ債、
ツ・1ツ行ツ姪堋づーツづ青づ?つュツづィツ陛板つキ
ツ・2ツ行ツ姪堋づーツづ青づ?つュツづィツ陛板つウツづ按つ「
ツづ?つ「ツつ、ツ湘ェツ債?づーツ考ツつヲツづ慊つオツづ・ツつ、ツ。

ツつサツつ、ツつキツづゥツづ?つケツづアツづ猟つ「ツづ個湘ウツ妥板づ債篠淞づ個づヲツつ、ツづ可陛渉づュツづィツづ慊つキツ。

ツ?慊?崢?慊?崢??
ツ?慊?崢?崢?崢??

ツつアツつアツづ?、ツ各ツ療アツづーツ個ゥツづ?つ「ツつォツづ慊つオツづ・ツつ、ツ。
1ツ療アツ姪堋づ債、ツづ青づ?つュツづィツ陛板つオツつスツ陛サツつェツつ「ツつ「ツつゥツ、ツづ青づ?つュツづィツ陛板つウツづ按つ「ツ陛サツつェツつ「ツつ「ツつゥツづ?つソツづァツづ?つオツづ・ツつ、ツ。
ツ?慊づ個青板づ個陛サツつェツ堕スツつ「ツづ個づ?つ?つォツづァツつゥツづ可づ青づ?つュツづィツ陛板つオツつスツ陛サツつェツつ「ツつ「ツづ?つキツづ仰。
ツつアツづ個づヲツつ、ツづ可、ツ各ツ行ツづーツづ青づ?つュツづィツ陛板つキツつゥツづ青づ?つュツづィツ陛板つウツづ按つ「ツつゥツづーツ個按づ淞づ?つィツつッツづ篠、
ツつ?づ?づ債、ツ各ツ療アツづーツづ青づ?つュツづィツ陛板つキツつゥツづ青づ?つュツづィツ陛板つウツづ按つ「ツつゥツづ債篠ゥツ督ョツ的ツづ可仰?づ慊づィツづ慊つキツ。

ツ・2ツ療アツ姪堋?ィツづ青づ?つュツづィツ陛板つウツづ按つ「
ツ・3ツ療アツ姪堋?ィツづ青づ?つュツづィツ陛板つオツづ?づ?づ青づ?つュツづィツ陛板つウツづ按つュツづ?づ?づ?つソツづァツづ?づ?つ「ツつ「
ツ・4ツ療アツ姪堋?ィツづ青づ?つュツづィツ陛板つウツづ按つ「
ツ・5ツ療アツ姪堋?ィツづ青づ?つュツづィツ陛板つキ

ツ?崢?崢?慊?崢??
ツ?崢?崢?崢?崢??

ツづヲツづ?づ?督堋つヲツづ?ツづ?つキツ。

 */
#include <iostream>
using namespace std;

int h, w, ans;
int t[12][10002];
bool flg[12];

//ツ各ツ行ツづーツづ青づ?つュツづィツ陛板つキツつゥツつェツ個按づ慊づ?づ?つ「ツづゥツづ?つォ, ツ各ツ療アツづーツづ青づ?つュツづィツ陛板つオツつスツ陛サツつェツつ「ツつ「ツつゥツ仰?づ淞づゥ
//ツ催?妥・ツづ個青カツつォツ残ツづゥツつケツづアツづ猟つ「ツづーツ姪淞づィツ値ツづ?つオツづ?陛板つキ
int getMaxAlive(){
  int res = 0;

  for(int x = 0; x < w; x++){
    int colSum = 0;

    for(int y = 0; y < h; y++){
      if(flg[y]){
        colSum += !t[y][x];
      }
      else{
        colSum += t[y][x];
      }
    }

    res += max(colSum, h - colSum);
  }

  return res;
}

//ツ催?帰ツづ可づヲツづィツ各ツ行ツづーツづ青づ?つュツづィツ陛板つキツつゥツ個按づ淞づ慊つキ
void rec(int y){
  if(y == h){
    ans = max(ans, getMaxAlive());
    return;
  }

  //ツづ青づ?つュツづィツ陛板つウツづ按つ「
  flg[y] = 0;
  rec(y + 1);

  //ツづ青づ?つュツづィツ陛板つキ
  flg[y] = 1;
  rec(y + 1);
}

int main(){
  while(cin >> h >> w, h || w){
    for(int i = 0; i < h; i++){
      for(int j = 0; j < w; j++){
        cin >> t[i][j];
      }
    }

    ans = 0;
    rec(0);
    cout << ans << endl;
  }
}