#include <iostream>
using namespace std;
int main(void){
    
    //変数の宣言
    int x, y;
    
    //繰り返し処理をするときは「　for文　」を使う
    for(int i=1; i<=10000; i++){
        //各Caseの値を入力
        cin >> x >> y;
        
        //if文を使用してxの値とyの値が「 0 」なら終了の条件を考える
        if(x == 0 && y == 0){
            break;  
        }
        
        //else if： ifを満たしてない・成立してない条件下で条件を考える 
        else if(x < y){
            swap(x, y);
        }
        
        //xの値とyの値を交換する　➡　coutで表示の順番を入れ替えるだけ
        cout << y << " " << x << endl;
    }
    
    return 0;
    
}




/****************************************複数の条件式****************************************************
 
 
かつ・AND　➡　&&  ➡　　両方の条件が成立するときのみ成立の所へ行ける
またわ・OR　➡　||　➡　片方の条件が成立する　又は　　両方の条件が成立する　ときは成立の場所へ行ける
         
     
*********************************************************************************************************/




/****************************************　breakとは　***************************************************


☆繰り返し処理を終了・出処理から出たいときに使用

    
*********************************************************************************************************/



/****************************************　swapとは　***************************************************


☆s数字を入れ替える
    swap(a,b) ➡　a と  b の　値を入れ替える　
    
    
*********************************************************************************************************/












